tsugli/stm32/windcatcher/stm32_mini_lcd.c
/**
 ******************************************************************************
 * @file    stm32_mini_lcd.c
 * @author  Martin Thomas (not STM),
 *          based on code/information from: Sitronix ST7781 data-sheet,
 *          STM MCD Application Team and PowerCPU.com
 * @version V0.0.3
 * @date    28. Nov. 2009
 * @brief   This file contains all the functions for the LCD firmware driver.
 ******************************************************************************
 * @copy
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING USERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, THE CREATOR OF THIS CODE SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2009 M. Thomas and STMicroelectronics</center></h2>
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32_mini_lcd.h"
#include "fonts.h"

/* Hardware-Connection:
 STM32        TFT-Module
 -----------------------
 PB8~15 <---> DB0~7
 PC0~7  <---> DB10~17
 PC8     ---> nCS        (low=selected, high=unselected)
 PC9     ---> RS         (low=command, high=data or parameter)
 PC10    ---> nWR        (low=write)
 PC11    ---> nRD        (low=read)
 PC12    ---> nReset     (low=in reset)
 PC13    ---> Back-Light LEDs enable (NPN)

 I80-system 16-bit interface(?)
 IM3 IM2 IM1 IM0 Interface
 0   0   1   0  16-bit
 RS /RD /WR  Read Back Selection
 0  1  /\   Write Command (DB[17:10])
 1  1  /\   Write Display Data (DB[17:10])
 1  /\  1   Read Display Data (DB[17:10])
 1  /\  1   Read Parameter or Status (DB[17:10])
 0  1  /\   Write Command (DB[17:10], DB[8:1])
 1  1  /\   Write Display Data (DB[17:10], DB[8:1])
 1  /\  1   Read Display Data (DB[17:10], DB[8:1])
 1  /\  1   Read Parameter or Status (DB[17:10], DB[8:1])
 ( /\ = raising )
 */

/** @addtogroup Utilities
 * @{
 */

/** @defgroup STM32_MINI_LCD
 * @brief This file includes the LCD driver for the STM32 MINI 2.8" TFT
 * using a "bit-bang" parallel interface. Controller is most probably
 * a Sitronix ST7783.
 * @{
 */

/** @defgroup STM32_MINI_LCD_Private_TypesDefinitions
 * @{
 */
/**
 * @}
 */

/** @defgroup STM32_MINI_LCD_Private_Defines
 * @{
 */
/**
 * @}
 */

/** @defgroup STM32_MINI_LCD_Private_Macros
 * @{
 */
#define Set_Cs  GPIO_SetBits(GPIOC,GPIO_Pin_8);
#define Clr_Cs  GPIO_ResetBits(GPIOC,GPIO_Pin_8);

#define Set_Rs  GPIO_SetBits(GPIOC,GPIO_Pin_9);
#define Clr_Rs  GPIO_ResetBits(GPIOC,GPIO_Pin_9);

#define Set_nWr GPIO_SetBits(GPIOC,GPIO_Pin_10);
#define Clr_nWr GPIO_ResetBits(GPIOC,GPIO_Pin_10);

#define Set_nRd GPIO_SetBits(GPIOC,GPIO_Pin_11);
#define Clr_nRd GPIO_ResetBits(GPIOC,GPIO_Pin_11);

#define Set_Rst GPIO_SetBits(GPIOC,GPIO_Pin_12);
#define Clr_Rst GPIO_ResetBits(GPIOC,GPIO_Pin_12);

#define Lcd_Light_ON   GPIO_SetBits(GPIOC,GPIO_Pin_13);
#define Lcd_Light_OFF  GPIO_ResetBits(GPIOC,GPIO_Pin_13);
/**
 * @}
 */

/** @defgroup STM32_MINI_LCD_Private_Variables
 * @{
 */
/* Global variables to set the written text colors */
static uint16_t TextColor = 0x0000, BackColor = 0xFFFF;

/* Global variable to keep the orientation-mode */
static LCD_OrientationMode_t orientation_mode = LCD_ORIENTATION_DEFAULT;

/**
 * @}
 */

/** @defgroup STM32_MINI_LCD_Private_FunctionPrototypes
 * @{
 */
#ifndef LCD_USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* LCD_USE_Delay*/

/**
 * @}
 */

/** @defgroup STM32_MINI_LCD_Private_Functions
 * @{
 */

static void LCD_BusLinesDirection(int out) {
	GPIO_InitTypeDef GPIO_InitStructure;

	if (out) {
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	} else {
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	}
	// LSB
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10
			| GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14
			| GPIO_Pin_15;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	// MSB
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2
			| GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
}

static inline void LCD_BusLinesWrite(uint16_t data)
{
	// LSB of data to PB8-PB15, MSB of data to PC0-PC7
	u8 set, clear;
	set   = data;
	clear = ~set;
	GPIOB->BSRR = (set << 8) | (clear << 24);
	set   = data >> 8;
	clear = ~set;
	GPIOC->BSRR = set | (clear << 16);
}

static uint16_t LCD_BusLinesRead(void)
{
	uint16_t tmp;

	GPIOB->CRH = (GPIOB->CRH & 0x00000000) | 0x44444444; // Bus LSB Pins -> Input
	GPIOC->CRL = (GPIOC->CRL & 0x00000000) | 0x44444444; // Bus MSB Pins -> Input
	Clr_nRd;
	tmp = (((GPIOB->IDR)>>8)|((GPIOC->IDR)<<8));
	Set_nRd;
	GPIOB->CRH = (GPIOB->CRH & 0x00000000) | 0x33333333; // Bus LSB Pins -> Output
	GPIOC->CRL = (GPIOC->CRL & 0x00000000) | 0x33333333; // Bus MSB Pins -> Output

	return tmp;
}

static uint16_t LCD_ReadControllerID(void) {
	uint16_t tmp, tmp1, tmp2;

	// LCD_WriteReg(0x0000, 0x0001); //start oscillation
	// _delay_(5);

	LCD_BusLinesDirection(0);

	GPIO_ResetBits(GPIOC,LCD_CTRL_nCS_PIN);
	GPIO_SetBits(GPIOC,LCD_CTRL_RS_PIN);
	GPIO_ResetBits(GPIOC,LCD_CTRL_nRD_PIN);

	tmp1 = GPIO_ReadInputData(GPIOB);
	tmp2 = GPIO_ReadInputData(GPIOC);
	tmp = (tmp1 >> 8) | (tmp2 << 8);

	GPIO_SetBits(GPIOC,LCD_CTRL_nRD_PIN);
	GPIO_SetBits(GPIOC,LCD_CTRL_nCS_PIN);

	LCD_BusLinesDirection(1);

	return tmp;
}

/**
 * @brief  Setups the LCD.
 * @param  None
 * @retval LCD ID
 */
uint16_t LCD_Setup(void) {
	uint16_t id;

	LCD_InterfaceConfig();
	LCD_BackLight(ENABLE);

