tsugli/stm32/windcatcher/stm32_mini_lcd.c
	LCD_BusLinesWrite(0xffff);
	Set_Rst;
	Set_nWr;
	Set_Cs;
	Set_Rs;
	Set_nRd;

	/* Reset Controller  ------------------------------------------------------*/
	LCD_HardwareReset();
	LCD_WriteReg(0x0000, 0x0001); //start oscillation
	_delay_(5);

	/* Get Device ID Code ------------------------------------------------------*/
	id = LCD_ReadControllerID();

	if (id == 0x7783) {

		LCD_WriteReg(0x00FF, 0x0001); // FAh/FEh Enable: FXEN
		LCD_WriteReg(0x00F3, 0x0008); // not documented
		LCD_WriteReg(0x0001, 0x0100); // Driver Output Control: SS
		LCD_WriteReg(0x0002, 0x0700); // Driver Wave Control:
		// LCD_WriteReg(0x0003, 0x1030); // Entry Mode BGR=1,AM=0,ID1/0=1/1 // LS: 1028
		LCD_WriteReg(0x0003, LCD_ENTRY_MODE_DEFAULT);
		LCD_WriteReg(0x0004, 0x0000); // Resize Control
		LCD_WriteReg(0x0008, 0x0302); // Display Control 2
		LCD_WriteReg(0x0009, 0x0000); // Display Control 3
		LCD_WriteReg(0x000A, 0x0000); // Display Control 4
		LCD_WriteReg(0x0010, 0x0790); // Power Control 1 //PA:0x0790
		LCD_WriteReg(0x0011, 0x0005); // Power Control 2
		LCD_WriteReg(0x0012, 0x0000); // Power Control 3
		LCD_WriteReg(0x0013, 0x0000); // Power Control 4
		_delay_(10);
		LCD_WriteReg(0x0010, 0x12B0); // Power Control 1
		_delay_(5);
		LCD_WriteReg(0x0011, 0x0007); // Power Control 2
		_delay_(5);
		LCD_WriteReg(0x0012, 0x008B); // Power Control 3
		_delay_(5);
		LCD_WriteReg(0x0013, 0x1700); // Power Control 4
		_delay_(5);
		LCD_WriteReg(0x0029, 0x0022); // VCOMH Control

		// Gamma Controls 0x0030 = Gamma Control 1 ~ 0x003D = Gamma Control 10
		LCD_WriteReg(0x0030, 0x0000);
		LCD_WriteReg(0x0031, 0x0707);
		LCD_WriteReg(0x0032, 0x0505);
		LCD_WriteReg(0x0035, 0x0107);
		LCD_WriteReg(0x0036, 0x0008);
		LCD_WriteReg(0x0037, 0x0000);
		LCD_WriteReg(0x0038, 0x0202);
		LCD_WriteReg(0x0039, 0x0106);
		LCD_WriteReg(0x003C, 0x0202);
		LCD_WriteReg(0x003D, 0x0408);
		_delay_(5);

		/* Set GRAM area -----------------------------------------------------------*/
		LCD_WriteReg(0x0050, 0x0000); /* Horizontal GRAM Start Address */
		LCD_WriteReg(0x0051, 240-1);  /* Horizontal GRAM End Address */
		LCD_WriteReg(0x0052, 0x0000); /* Vertical GRAM Start Address */
		LCD_WriteReg(0x0053, 320-1);  /* Vertical GRAM End Address */
		LCD_WriteReg(0x0060, (1<<15) | (0x27<<8)); /* Gate Scan Line GS=1, NL=0x27->320 lines */
		LCD_WriteReg(0x0061, 0x0001); /* NDL=0,VLE=0,REV=1 */
		/* Partial Display Control -------------------------------------------------*/
		LCD_WriteReg(0x0080, 0x0000);
		LCD_WriteReg(0x0081, 0x0000);
		LCD_WriteReg(0x0082, 0x0000);
		LCD_WriteReg(0x0083, 0x0000);
		LCD_WriteReg(0x0084, 0x0000);
		LCD_WriteReg(0x0085, 0x0000);
		/* Panel Control -----------------------------------------------------------*/
		LCD_WriteReg(0x0090, 0x0033); // Panel Interface Control 1
		LCD_WriteReg(0x0092, 0x0000); // Panel Interface Control 2
		LCD_WriteReg(0x002B, 0x000B); // Frame Rate and Color Control
		LCD_WriteReg(0x0007, 0x0133); // Display Control 1

		_delay_(5);
		/* 50ms Display on stabling time */

		LCD_SetOrientation(LCD_ORIENTATION_DEFAULT);


		// LCD_WindowModeDisable();
	}
	Set_Cs;

	return id;
}

/**
 * @brief  Initializes the LCD.
 * @param  None
 * @retval None
 */
uint16_t LCD_Init(void) {
	/* Setups the LCD */
	return LCD_Setup();
}

/**
 * @brief  Sets the Text color.
 * @param  Color: specifies the Text color code RGB(5-6-5).
 * @retval None
 */
void LCD_SetTextColor(uint16_t Color) {
	TextColor = Color;
}

/**
 * @brief  Returns the Text color.
 * @param  None
 * @retval current TextColor
 */
uint16_t LCD_GetTextColor(void) {
	return TextColor;
}

/**
 * @brief  Sets the Background color.
 * @param  Color: specifies the Background color code RGB(5-6-5).
 * @retval None
 */
void LCD_SetBackColor(uint16_t Color) {
	BackColor = Color;
}

/**
 * @brief Sets the LCD orientation
 * @param m: orientation mode
 * @retval none
 */
void LCD_SetOrientation(LCD_OrientationMode_t m)
{
	uint16_t em;

	switch (m) {
	case LCD_PORTRAIT_TOP_DOWN:
		em = 0x1030;
		break;
	case LCD_PORTRAIT_BOTTOM_UP:
		em = 0x1010;
		break;
	case LCD_LANDSCAPE_TOP_DOWN:
		em = 0x1018;
		break;
	case LCD_LANDSCAPE_BOTTOM_UP:
		em = 0x1008;
		break;
	default:
		em = 0x0130;
		break;
	}
	LCD_WriteReg(0x0003, em);  /* Entry Mode */
	orientation_mode = m;
	LCD_SetCursor(0x00, 0x00);
}

/**
 * @brief Get current LCD orientation
 * @param none
 * @retval orientation
 */
LCD_OrientationMode_t LCD_GetOrientation(void)
{
	return orientation_mode;
}

/**
 * @brief Get width in current LCD orientation
 * @param none
 * @retval width
 */
uint16_t LCD_GetWidth(void)
{
	switch (orientation_mode) {
	case LCD_LANDSCAPE_TOP_DOWN:
	case LCD_LANDSCAPE_BOTTOM_UP:
		return LCD_HEIGHT_HW;
		break;
	case LCD_PORTRAIT_TOP_DOWN:
	case LCD_PORTRAIT_BOTTOM_UP:
	default:
		return LCD_WIDTH_HW;
	}
}

/**
 * @brief Get height in current LCD orientation
 * @param none
 * @retval height
 */
uint16_t LCD_GetHeight(void)
{
	switch (orientation_mode) {
	case LCD_LANDSCAPE_TOP_DOWN:
	case LCD_LANDSCAPE_BOTTOM_UP:
		return LCD_WIDTH_HW;
		break;
	case LCD_PORTRAIT_TOP_DOWN:
	case LCD_PORTRAIT_BOTTOM_UP:
	default:
		return LCD_HEIGHT_HW;
	}
}


/**
 * @brief  Clears the selected line.
 * @param  Line: the Line to be cleared.
 *   This parameter can be one of the following values:
 *     @arg Linex: where x can be 0..12
 * @retval None
 */
void LCD_ClearLine(uint8_t Line)
{
	LCD_DisplayStringLine(Line, "               ");
}

/**
 * @brief  Clears the hole LCD.
 * @param  Color: the color of the background.
 * @retval None
 */
void LCD_Clear(uint16_t Color)
{
	uint32_t index;

	LCD_SetCursor(0x0000, 0x0000);
	LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
	for (index = 0; index < (240 * 320L); index++) {
		LCD_WriteRAM(Color);
	}
	Set_Cs;

}

/**
 * @brief  Sets the cursor position.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @retval None
 */
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
	uint16_t he, ve, al, ah;

	switch (orientation_mode) {
	case LCD_PORTRAIT_TOP_DOWN:
		he = LCD_WIDTH_HW-1;
		ve = LCD_HEIGHT_HW-1;
		al = Xpos;
		ah = Ypos;
		break;
	case LCD_PORTRAIT_BOTTOM_UP:
		he = LCD_WIDTH_HW-1;
		ve = LCD_HEIGHT_HW-1-Ypos;
		al = Xpos;
		ah = LCD_HEIGHT_HW-1-Ypos;
		break;
	case LCD_LANDSCAPE_TOP_DOWN:
		he = LCD_WIDTH_HW-1;
		ve = LCD_HEIGHT_HW-1-Xpos;
		al = Ypos;
		ah = Xpos;
		break;
	case LCD_LANDSCAPE_BOTTOM_UP:
		he = LCD_WIDTH_HW-1-Ypos;
		ve = LCD_HEIGHT_HW-1-Xpos;
		al = Ypos;
		ah = Xpos;
		break;
	default:
		he = LCD_WIDTH_HW-1;
		ve = LCD_HEIGHT_HW-1;
		al = Xpos;
		ah = Ypos;
		break;
	}
	LCD_WriteReg(0x0051, he);
	LCD_WriteReg(0x0053, ve);
	LCD_WriteReg(0x0020, al);
	LCD_WriteReg(0x0021, ah);
}

/**
 * @brief  Draws a Pixel on LCD.
 * @param  x: x-coordinate
 * @param  y: y-coordinate
 * @param  Color: color
 * @retval None
 */
void LCD_DrawPixel(uint16_t x, uint16_t y, uint16_t Color)
{
	LCD_SetCursor(x, y);
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(Color);
	Set_Cs;
}

/**
 * @brief  Reads color of Pixel on LCD
 * @param  x: x-coordinate
 * @param  y: y-coordinate
 * @retval Color
 */
uint16_t LCD_GetPixel(uint16_t x, uint16_t y)
{
	uint16_t c;

	LCD_SetCursor(x, y);
	LCD_WriteRAM_Prepare();
	LCD_BusLinesRead();     /* dummy read */
	c = LCD_BusLinesRead(); /* "real" read */
	Set_Cs;

	return c;
}

/**
 * @brief  Draws a character on LCD.
 * @param  Xpos: the Line where to display the character shape.
 * @param  Ypos: start column address.
 * @param  c: pointer to the character data.
 * @retval None
 */
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint16_t *c)
{
	uint32_t index = 0, i = 0;
	uint8_t Xaddress = 0;

	Xaddress = Xpos;

	LCD_SetCursor(Xaddress, Ypos);

	for (index = 0; index < 24; index++) {
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		for (i = 0; i < 16; i++) {
			if ((c[index] & (1 << i)) == 0x00) {
				LCD_WriteRAM(BackColor);
			} else {
				LCD_WriteRAM(TextColor);
			}
		}
		Ypos++;
		LCD_SetCursor(Xaddress, Ypos);
	}
	Set_Cs;
}

/**
 * @brief  Displays one character (16dots width, 24dots height).
 * @param  Line: the Line where to display the character shape .
 *   This parameter can be one of the following values:
 *     @arg Linex: where x can be 0..9
 * @param  Column: start column address.
 * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
 * @retval None
 */
void LCD_DisplayChar(uint16_t Line, uint16_t Column, uint8_t Ascii)
{
	Ascii -= 32;
	// LCD_DrawChar(Line, Column, &ASCII_Table[Ascii * 24]);
	LCD_DrawChar(Column, Line, &ASCII_Table[Ascii * 24]);
}

/**
 * @brief  Displays a maximum of 15 char on the LCD.
 * @param  Line: the Line where to display the character shape .
 *   This parameter can be one of the following values:
 *     @arg Linex: where x can be 0..9
 * @param  *ptr: pointer to string to display on LCD.
 * @retval None
 */
void LCD_DisplayStringLine(uint16_t Line, /*uint8_t*/const char *ptr)
{
	uint32_t i = 0;
	uint16_t refcolumn = 0;
	/* Send the string character by character on lCD */
	while ((*ptr != 0) & (i < 15)) {
		/* Display one character on LCD */
		LCD_DisplayChar(Line, refcolumn, *ptr);
		/* Increment the column position by 16 */
		refcolumn += 16;
		/* Point on the next character */
		ptr++;
		/* Increment the character counter */
		i++;
	}
}

/**
 * @brief  Sets a display window
 * @param  Xpos: specifies the X buttom left position.
 * @param  Ypos: specifies the Y buttom left position.
 * @param  Height: display window height.
 * @param  Width: display window width.
 * @retval None
 */
void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint8_t Height,
		uint16_t Width)
{
	/* Horizontal GRAM Start Address */
	if (Xpos >= Height) {
		LCD_WriteReg(R80, (Xpos - Height + 1));
	} else {
		LCD_WriteReg(R80, 0);
	}
	/* Horizontal GRAM End Address */
	LCD_WriteReg(R81, Xpos);
	/* Vertical GRAM Start Address */
	if (Ypos >= Width) {
		LCD_WriteReg(R82, (Ypos - Width + 1));
	} else {
		LCD_WriteReg(R82, 0);
	}
	/* Vertical GRAM End Address */
	LCD_WriteReg(R83, Ypos);
	LCD_SetCursor(Xpos, Ypos);
}

/**
 * @brief  Disables LCD Window mode.
 * @param  None
 * @retval None
 */
void LCD_WindowModeDisable(void)
{
	LCD_SetDisplayWindow(239, 0x13F, 240, 320);
	LCD_WriteReg(R3, LCD_ENTRY_MODE_DEFAULT); // was 0x1028
}

/**
 * @brief  Displays a line.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Length: line length.
 * @param  Direction: line direction.
 *   This parameter can be one of the following values: LCD_LINE_VERTICAL or Horizontal.
 * @retval None
 */
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length,
		uint8_t Direction)
{
	uint32_t i = 0;

	LCD_SetCursor(Xpos, Ypos);
	if (Direction == LCD_LINE_HORIZONTAL) {
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		for (i = 0; i < Length; i++) {
			LCD_WriteRAM(TextColor);
		}
	} else {
		for (i = 0; i < Length; i++) {
			LCD_WriteRAMWord(TextColor);
			Ypos++;
			LCD_SetCursor(Xpos, Ypos);
		}
	}
	LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT,LCD_NCS_PIN, Bit_SET);
}

/**
 * @brief  Displays a rectangle.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Height: display rectangle height.
 * @param  Width: display rectangle width.
 * @retval None
 */
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
	LCD_DrawLine(Xpos, Ypos, Width, LCD_LINE_HORIZONTAL);
	LCD_DrawLine(Xpos, Ypos, Height, LCD_LINE_VERTICAL);
	LCD_DrawLine((Xpos + Width - 1), Ypos, Height, LCD_LINE_VERTICAL);
	LCD_DrawLine(Xpos, (Ypos + Height - 1), Width, LCD_LINE_HORIZONTAL);
}

/**
 * @brief  Displays a box (filled rectangle).
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Height: display rectangle height.
 * @param  Width: display rectangle width.
 * @retval None
 */
void LCD_DrawBox(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
	int32_t CurY;

	for (CurY = Ypos; CurY < (Ypos + Height); CurY++) {
		LCD_DrawLine(Xpos, CurY, Width, LCD_LINE_HORIZONTAL);
	}
}

/**
 * @brief  Displays a circle.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Radius
 * @retval None
 */
void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
	int32_t  D;    /* Decision Variable */
	uint32_t CurX; /* Current X Value */
	uint32_t CurY; /* Current Y Value */

	D = 3 - (Radius << 1);
	CurX = 0;
	CurY = Radius;

