tsugli/stm32/windcatcher/stm32_mini_lcd.c
	while (CurX <= CurY) {
		LCD_SetCursor(Xpos + CurX, Ypos + CurY);
		LCD_WriteRAMWord(TextColor);
		LCD_SetCursor(Xpos + CurX, Ypos - CurY);
		LCD_WriteRAMWord(TextColor);
		LCD_SetCursor(Xpos - CurX, Ypos + CurY);
		LCD_WriteRAMWord(TextColor);
		LCD_SetCursor(Xpos - CurX, Ypos - CurY);
		LCD_WriteRAMWord(TextColor);
		LCD_SetCursor(Xpos + CurY, Ypos + CurX);
		LCD_WriteRAMWord(TextColor);
		LCD_SetCursor(Xpos + CurY, Ypos - CurX);
		LCD_WriteRAMWord(TextColor);
		LCD_SetCursor(Xpos - CurY, Ypos + CurX);
		LCD_WriteRAMWord(TextColor);
		LCD_SetCursor(Xpos - CurY, Ypos - CurX);
		LCD_WriteRAMWord(TextColor);
		if (D < 0) {
			D += (CurX << 2) + 6;
		} else {
			D += ((CurX - CurY) << 2) + 10;
			CurY--;
		}
		CurX++;
	}
	LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT,LCD_NCS_PIN, Bit_SET);
}

/**
 * @brief  Displays a monocolor picture.
 * @param  Pict: pointer to the picture array.
 * @retval None
 */
void LCD_DrawMonoPict(const uint32_t *Pict)
{
	uint32_t index = 0, i = 0;
	LCD_SetCursor(0, 319);
	LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
	for (index = 0; index < 2400; index++) {
		for (i = 0; i < 32; i++) {
			if ((Pict[index] & (1 << i)) == 0x00) {
				LCD_WriteRAM(BackColor);
			} else {
				LCD_WriteRAM(TextColor);
			}
		}
	}
	LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT,LCD_NCS_PIN, Bit_SET);
}

#ifdef USE_LCD_DrawBMP
/**
 * @brief  Displays a bitmap picture loaded in the SPI Flash.
 * @param  BmpAddress: Bmp picture address in the SPI Flash.
 * @retval None
 */
//void LCD_DrawBMP(uint32_t BmpAddress)
//{
//  uint32_t i = 0, size = 0;
//
//  /* Read bitmap size */
//  SPI_FLASH_BufferRead((uint8_t*)&size, BmpAddress + 2, 4);
//
//  /* get bitmap data address offset */
//  SPI_FLASH_BufferRead((uint8_t*)&i, BmpAddress + 10, 4);
//
//  size = (size - i)/2;
//
//  SPI_FLASH_StartReadSequence(BmpAddress + i);
//
//  /* Disable SPI1  */
//  SPI_Cmd(SPI1, DISABLE);
//  /* SPI in 16-bit mode */
//  SPI_DataSizeConfig(SPI1, SPI_DataSize_16b);
//
//  /* Enable SPI1  */
//  SPI_Cmd(SPI1, ENABLE);
//
//  /* Set GRAM write direction and BGR = 1 */
//  /* I/D=00 (LCD_LINE_HORIZONTAL : decrement, LCD_LINE_VERTICAL : decrement) */
//  /* AM=1 (address is updated in vertical writing direction) */
//  LCD_WriteReg(R3, 0x1008);
//
//  LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
//
//  /* Read bitmap data from SPI Flash and send them to LCD */
//  for(i = 0; i < size; i++)
//  {
//    LCD_WriteRAM(__REV_HalfWord(SPI_FLASH_SendHalfWord(0xA5A5)));
//  }
//
//  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);
//
//  /* Deselect the FLASH: Chip Select high */
//  SPI_FLASH_CS_HIGH();
//
//  /* Disable SPI1  */
//  SPI_Cmd(SPI1, DISABLE);
//  /* SPI in 8-bit mode */
//  SPI_DataSizeConfig(SPI1, SPI_DataSize_8b);
//
//  /* Enable SPI1  */
//  SPI_Cmd(SPI1, ENABLE);
//
//  /* Set GRAM write direction and BGR = 1 */
//  /* I/D = 01 (LCD_LINE_HORIZONTAL : increment, LCD_LINE_VERTICAL : decrement) */
//  /* AM = 1 (address is updated in vertical writing direction) */
//  LCD_WriteReg(R3, 0x1018);
//}


/**
 * @brief  Displays a bitmap picture loaded in the SPI Flash.
 * @param  BmpAddress: Bmp picture address in the SPI Flash.
 * @retval None
 */
void LCD_DrawBMP(const uint16_t *BmpAddress)
{
	uint32_t i = 0, size = 0;
	/* Read bitmap size */
	size = BmpAddress[1] | (BmpAddress[2] << 16);
	/* get bitmap data address offset */
	i = BmpAddress[5] | (BmpAddress[6] << 16);
	size = (size - i)/2;
	BmpAddress += i/2;
	/* Set GRAM write direction and BGR = 1 */
	/* I/D=00 (LCD_LINE_HORIZONTAL : decrement, LCD_LINE_VERTICAL : decrement) */
	/* AM=1 (address is updated in vertical writing direction) */
	LCD_WriteReg(R3, 0x1008);
	LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
	/* Read bitmap data from SPI Flash and send them to LCD */
	for(i = 0; i < size; i++)
	{
		LCD_WriteRAM(BmpAddress[i]);
	}
	LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);
	/* Set GRAM write direction and BGR = 1 */
	/* I/D = 01 (LCD_LINE_HORIZONTAL : increment, LCD_LINE_VERTICAL : decrement) */
	/* AM = 1 (address is updated in vertical writing direction) */
	/// LCD_WriteReg(R3, 0x1018);
	LCD_WriteReg(0x0003, 0x1030);
}
#endif


/**
 * @brief  Prepare to write to the LCD RAM.
 * @param  None
 * @retval None
 */
void LCD_WriteRAM_Prepare(void) {
	Clr_Cs;
	Clr_Rs;
	Set_nRd;
	LCD_BusLinesWrite(0x0022); /* Select GRAM Reg */
	Clr_nWr;
	Set_nWr;
	Set_Rs;
}

/**
 * @brief  Writes 1 word to the LCD RAM.
 * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
 * @retval None
 */
void LCD_WriteRAMWord(uint16_t RGB_Code) {
	LCD_WriteRAM_Prepare();
	LCD_WriteRAM(RGB_Code);
}

/**
 * @brief  Writes to the selected LCD register.
 * @param  LCD_Reg: address of the selected register.
 * @param  LCD_RegValue: value to write to the selected register.
 * @retval None
 */
void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue) {
	Clr_Cs;
	Clr_Rs;
	Set_nRd;
	LCD_BusLinesWrite(LCD_Reg);
	Clr_nWr;
	Set_nWr;
	Set_Rs;
	LCD_BusLinesWrite(LCD_RegValue);
	Clr_nWr;
	Set_nWr;
	Set_Cs;
}

/**
 * @brief  Writes to the LCD RAM.
 * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
 * @retval None
 */
void LCD_WriteRAM(uint16_t RGB_Code)
{
	LCD_BusLinesWrite(RGB_Code);
	Clr_nWr;
	Set_nWr;
	// Set_Cs;
}


/**
 * @brief Release LCD by setting /CS
 * @param none
 * @retval none
 */
void LCD_Release(void)
{
	Set_Cs;
}

/**
 * @brief  Power on the LCD.
 * @param  None
 * @retval None
 */
void LCD_PowerOn(void)
{
	/* Power On sequence ---------------------------------------------------------*/
	LCD_WriteReg(0x0010, 0x0790); // Power Control 1 //PA:0x0790
	LCD_WriteReg(0x0011, 0x0005); // Power Control 2
	LCD_WriteReg(0x0012, 0x0000); // Power Control 3
	LCD_WriteReg(0x0013, 0x0000); // Power Control 4
	_delay_(20);
	LCD_WriteReg(0x0010, 0x12B0); // Power Control 1
	LCD_WriteReg(0x0011, 0x0007); // Power Control 2
	_delay_(5);
	LCD_WriteReg(0x0012, 0x008B); // Power Control 3
	_delay_(5);
	LCD_WriteReg(0x0013, 0x1700); // Power Control 4
	LCD_WriteReg(0x0029, 0x0022); // VCOMH Control
	_delay_(5);
}

void LCD_PowerOff(void)
{
	// LCD_WriteReg(0x0007, 0x0000); // display OFF
	LCD_WriteReg(0x0010, 0x0000); // SAP, BT[3:0], APE, AP, DSTB, SLP
	LCD_WriteReg(0x0011, 0x0000); // DC1[2:0], DC0[2:0], VC[2:0]
	LCD_WriteReg(0x0012, 0x0000); // VREG1OUT voltage
	LCD_WriteReg(0x0013, 0x0000); // VDV[4:0] for VCOM amplitude
	_delay_(20); // Dis-charge capacitor power voltage
	LCD_WriteReg(0x0010, 0x0002); // SAP, BT[3:0], APE, AP, DSTB, SLP
}

/**
 * @brief  Enables the Display.
 * @param  None
 * @retval None
 */
void LCD_DisplayOn(void)
{
	/* Display On */
	// LCD_WriteReg(R7, 0x0173); /* 262K color and display ON */
	LCD_WriteReg(0x0007, 0x0133);
	// _delay_(5); /* 50ms Display on stabling time */
}

/**
 * @brief  Disables the Display.
 * @param  None
 * @retval None
 */
void LCD_DisplayOff(void)
{
	/* Display Off */
	LCD_WriteReg(R7, 0x0);
}

/**
 * @brief  Sets or reset LCD control lines.
 * @param  GPIOx: where x can be B or D to select the GPIO peripheral.
 * @param  CtrlPins: the Control line. This parameter can be:
 *     @arg LCD_NCS_PIN: Chip Select pin
 * @param  BitVal: specifies the value to be written to the selected bit.
 *   This parameter can be:
 *     @arg Bit_RESET: to clear the port pin
 *     @arg Bit_SET: to set the port pin
 * @retval None
 */
void LCD_CtrlLinesWrite(GPIO_TypeDef* GPIOx, uint16_t CtrlPins,
		BitAction BitVal)
{
	/* Set or Reset the control lines */
	if (BitVal == Bit_SET) {
		GPIO_SetBits(GPIOx, CtrlPins);
	} else {
		GPIO_ResetBits(GPIOx, CtrlPins);
	}
}

/**
 * @brief  Switch LCD Back-Light (no PWM)
 * @param  0=off, !=0 on
 * @retval None
 */
void LCD_BackLight(BitAction ba)
{
	LCD_CtrlLinesWrite(LCD_CTRL_GPIO_PORT,LCD_CTRL_BL_PIN, ba);
}

/**
 * @brief  Configures the LCD_SPI interface.
 * @param  None
 * @retval None
 */
void LCD_InterfaceConfig(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB
			| RCC_APB2Periph_GPIOC, ENABLE);

	// Bus LSB
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10
			| GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14
			| GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	// BUS MSB
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2
			| GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	// Control Lines
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10
			| GPIO_Pin_11 | GPIO_Pin_12;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	// Back-Light
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
}

void LCD_HardwareReset(void)
{
	LCD_CtrlLinesWrite(LCD_CTRL_GPIO_PORT,LCD_CTRL_RST_PIN, Bit_SET);
	LCD_CtrlLinesWrite(LCD_CTRL_GPIO_PORT,LCD_CTRL_RST_PIN, Bit_RESET);
	_delay_(5);
	LCD_CtrlLinesWrite(LCD_CTRL_GPIO_PORT,LCD_CTRL_RST_PIN, Bit_SET);
	_delay_(5);
}

#ifndef LCD_USE_Delay
/**
 * @brief  Inserts a delay time.
 * @param  nCount: specifies the delay time length.
 * @retval None
 */
static void delay(__IO uint32_t nCount)
{
	volatile uint32_t index = 0;
	for(index = (100000 * nCount); index != 0; index--)
	{
	}
}
#endif /* LCD_USE_Delay*/
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
